addons/l10n_anz_ubl_pint/tests/expected_xmls/invoice.xml

<?xml version='1.0' encoding='UTF-8'?>
<Invoice xmlns:cac="urn:oasis:names:specification:ubl:schema:xsd:CommonAggregateComponents-2" xmlns="urn:oasis:names:specification:ubl:schema:xsd:Invoice-2" xmlns:cbc="urn:oasis:names:specification:ubl:schema:xsd:CommonBasicComponents-2">
  <cbc:CustomizationID>urn:peppol:pint:billing-1@aunz-1</cbc:CustomizationID>
  <cbc:ProfileID>urn:peppol:bis:billing</cbc:ProfileID>
  <cbc:ID>INV/18-19/0001</cbc:ID>
  <cbc:IssueDate>2019-01-01</cbc:IssueDate>
  <cbc:DueDate>2019-01-01</cbc:DueDate>
  <cbc:InvoiceTypeCode>380</cbc:InvoiceTypeCode>
  <cbc:DocumentCurrencyCode>NZD</cbc:DocumentCurrencyCode>
  <cbc:TaxCurrencyCode>AUD</cbc:TaxCurrencyCode>
  <cac:OrderReference>
    <cbc:ID>INV/18-19/0001</cbc:ID>
  </cac:OrderReference>
  <cac:AccountingSupplierParty>
    <cac:Party>
      <cbc:EndpointID schemeID="0151">11225459588</cbc:EndpointID>
      <cac:PartyName>
        <cbc:Name>company_1_data</cbc:Name>
      </cac:PartyName>
      <cac:PostalAddress>
        <cbc:StreetName>Henry Lawson Drive</cbc:StreetName>
        <cbc:CityName>Home Rule</cbc:CityName>
        <cbc:PostalZone>2850</cbc:PostalZone>
        <cbc:CountrySubentity>Western Australia</cbc:CountrySubentity>
        <cac:Country>
          <cbc:IdentificationCode>AU</cbc:IdentificationCode>
        </cac:Country>
      </cac:PostalAddress>
      <cac:PartyTaxScheme>
        <cbc:CompanyID>11225459588</cbc:CompanyID>
        <cac:TaxScheme>
          <cbc:ID>GST</cbc:ID>
        </cac:TaxScheme>
      </cac:PartyTaxScheme>
      <cac:PartyLegalEntity>
        <cbc:RegistrationName>company_1_data</cbc:RegistrationName>
        <cbc:CompanyID schemeID="0151">11225459588</cbc:CompanyID>
      </cac:PartyLegalEntity>
      <cac:Contact>
        <cbc:Name>company_1_data</cbc:Name>
        <cbc:Telephone>+61 412 345 678</cbc:Telephone>
      </cac:Contact>
    </cac:Party>
  </cac:AccountingSupplierParty>
  <cac:AccountingCustomerParty>
    <cac:Party>
      <cbc:EndpointID schemeID="0088">9429047488083</cbc:EndpointID>
      <cac:PartyName>
        <cbc:Name>partner_a</cbc:Name>
      </cac:PartyName>
      <cac:PostalAddress>
        <cbc:StreetName>Victoria Street</cbc:StreetName>
        <cbc:CityName>Hamilton</cbc:CityName>
        <cbc:PostalZone>3247</cbc:PostalZone>
        <cbc:CountrySubentity>West Coast</cbc:CountrySubentity>
        <cac:Country>
          <cbc:IdentificationCode>NZ</cbc:IdentificationCode>
        </cac:Country>
      </cac:PostalAddress>
      <cac:PartyTaxScheme>
        <cbc:CompanyID>49098576</cbc:CompanyID>
        <cac:TaxScheme>
          <cbc:ID>GST</cbc:ID>
        </cac:TaxScheme>
      </cac:PartyTaxScheme>
      <cac:PartyLegalEntity>
        <cbc:RegistrationName>partner_a</cbc:RegistrationName>
        <cbc:CompanyID schemeID="0088">49098576</cbc:CompanyID>
      </cac:PartyLegalEntity>
      <cac:Contact>
        <cbc:Name>partner_a</cbc:Name>
        <cbc:Telephone>+64 21 123 4567</cbc:Telephone>
      </cac:Contact>
    </cac:Party>
  </cac:AccountingCustomerParty>
  <cac:Delivery>
    <cac:DeliveryLocation>
      <cac:Address>
        <cbc:StreetName>Victoria Street</cbc:StreetName>
        <cbc:CityName>Hamilton</cbc:CityName>
        <cbc:PostalZone>3247</cbc:PostalZone>
        <cbc:CountrySubentity>West Coast</cbc:CountrySubentity>
        <cac:Country>
          <cbc:IdentificationCode>NZ</cbc:IdentificationCode>
        </cac:Country>
      </cac:Address>
    </cac:DeliveryLocation>
    <cac:DeliveryParty>
      <cac:PartyName>
        <cbc:Name>partner_a</cbc:Name>
      </cac:PartyName>
    </cac:DeliveryParty>
  </cac:Delivery>
  <cac:PaymentMeans>
    <cbc:PaymentMeansCode name="mutually defined">ZZZ</cbc:PaymentMeansCode>
    <cbc:PaymentID>INV/18-19/0001</cbc:PaymentID>
  </cac:PaymentMeans>
  <cac:PaymentTerms>
    <cbc:Note>Payment terms: Immediate Payment</cbc:Note>
  </cac:PaymentTerms>
  <cac:TaxTotal>
    <cbc:TaxAmount currencyID="NZD">200.00</cbc:TaxAmount>
    <cac:TaxSubtotal>
      <cbc:TaxableAmount currencyID="NZD">2000.00</cbc:TaxableAmount>
      <cbc:TaxAmount currencyID="NZD">200.00</cbc:TaxAmount>
      <cac:TaxCategory>
        <cbc:ID>S</cbc:ID>
        <cbc:Percent>10.0</cbc:Percent>
        <cac:TaxScheme>
          <cbc:ID>GST</cbc:ID>
        </cac:TaxScheme>
      </cac:TaxCategory>
    </cac:TaxSubtotal>
  </cac:TaxTotal>
  <cac:TaxTotal>
    <cbc:TaxAmount currencyID="AUD">100.00</cbc:TaxAmount>
  </cac:TaxTotal>
  <cac:LegalMonetaryTotal>
    <cbc:LineExtensionAmount currencyID="NZD">2000.00</cbc:LineExtensionAmount>
    <cbc:TaxExclusiveAmount currencyID="NZD">2000.00</cbc:TaxExclusiveAmount>
    <cbc:TaxInclusiveAmount currencyID="NZD">2200.00</cbc:TaxInclusiveAmount>
    <cbc:PrepaidAmount currencyID="NZD">0.00</cbc:PrepaidAmount>
    <cbc:PayableAmount currencyID="NZD">2200.00</cbc:PayableAmount>
  </cac:LegalMonetaryTotal>
  <cac:InvoiceLine>
    <cbc:ID>1</cbc:ID>
    <cbc:InvoicedQuantity unitCode="C62">1.0</cbc:InvoicedQuantity>
    <cbc:LineExtensionAmount currencyID="NZD">2000.00</cbc:LineExtensionAmount>
    <cac:Item>
      <cbc:Description>product_a</cbc:Description>
      <cbc:Name>product_a</cbc:Name>
      <cac:ClassifiedTaxCategory>
        <cbc:ID>S</cbc:ID>
        <cbc:Percent>10.0</cbc:Percent>
        <cac:TaxScheme>
          <cbc:ID>GST</cbc:ID>
        </cac:TaxScheme>
      </cac:ClassifiedTaxCategory>
    </cac:Item>
    <cac:Price>
      <cbc:PriceAmount currencyID="NZD">2000.0</cbc:PriceAmount>
    </cac:Price>
  </cac:InvoiceLine>
</Invoice>
